In [1]:
import pandas as pd
import numpy as np

In [4]:
a = ["Hello","world","of","pyhton",1,2]
b = pd.Series(a)
print(b)
print(type(b))

0     Hello
1     world
2        of
3    pyhton
4         1
5         2
dtype: object
<class 'pandas.core.series.Series'>

In [5]:
# Series

In [6]:
a = {"one":"Apple",2:"Banana","Three":'Orange'}
b = pd.Series(a)
print(b)

one       Apple
2        Banana
Three    Orange
dtype: object

In [9]:
print(b.axes)

[Index(['one', 2, 'Three'], dtype='object')]

In [23]:
s = pd.Series(["Heloo","world","python",1],index=[1,3,"Hello",7])
# To change the axes values pass index values
print(s)

1         Heloo
3         world
Hello    python
7             1
dtype: object

In [15]:
print(s[3]) # Indexing

world

In [18]:
print(s[[3,7]]) # To get multiple elements

3    world
7        1
dtype: object

In [24]:
print(s["Hello"])

python

Write a Pandas program to compare the elements of the two Pandas Series. Sample Series: [9,8,7,6,5,4,3,2,1],[1,2, 3,4, 5,6, 7,8,9]

In [26]:
a = pd.Series([9,8,7,6,5,4,3,2,1])
b = pd.Series([1,2, 3,4, 5,6, 7,8,9])
print(a==b)

0    False
1    False
2    False
3    False
4     True
5    False
6    False
7    False
8    False
dtype: bool

In [27]:
d1 = {'a’': 10, 'b': 20, 'c':30, 'd':40, 'e':50}
d2 = pd.Series(d1)
d2

a’    10
b     20
c     30
d     40
e     50
dtype: int64

In [28]:
a = pd.Series([1,2,3,4,5,6])
print(list(a))

[1, 2, 3, 4, 5, 6]

In [35]:
d = {
    "First":[1,2,3,4],
    "Second":[10.0,2.3,3.4,5.0],
    "Third":["Hello","Python","World","snake"]
}
df = pd.DataFrame(d)
print(df)

   First  Second   Third
0      1    10.0   Hello
1      2     2.3  Python
2      3     3.4   World
3      4     5.0   snake

In [36]:
df

   First  Second   Third
0      1    10.0   Hello
1      2     2.3  Python
2      3     3.4   World
3      4     5.0   snake

In [40]:
df.T # T Means Transpose ["Convers rows into columns and columns into rows"]

            0       1      2      3
First       1       2      3      4
Second     10     2.3    3.4      5
Third   Hello  Python  World  snake

In [41]:
df.ndim

2

In [43]:
print(df.size)

12

In [45]:
df.shape # (prints total no. of rows and total no. of columns)

(4, 3)

In [49]:
df.sample(2) # Gives random value from the DataFrame

   First  Second   Third
3      4     5.0   snake
1      2     2.3  Python

In [67]:
# TO Add a column in dataframe
import numpy as np
df['Fourth'] = [4,2,9.0,1]
print(df)
print(df.dtypes)

   First  Second   Third  Fourth
0      1    10.0   Hello     4.0
1      2     2.3  Python     2.0
2      3     3.4   World     9.0
3      4     5.0   snake     1.0
First       int64
Second    float64
Third      object
Fourth    float64
dtype: object

In [54]:
# To make column as index or row
df2 = df.set_index('Fourth')
print(df2)

        First  Second   Third
Fourth
NaN         1    10.0   Hello
2           2     2.3  Python
9.0         3     3.4   World
Hello       4     5.0   snake

In [55]:
df2.values

array([[1, 10.0, 'Hello'],
       [2, 2.3, 'Python'],
       [3, 3.4, 'World'],
       [4, 5.0, 'snake']], dtype=object)

In [57]:
print(df['Second'])

0    10.0
1     2.3
2     3.4
3     5.0
Name: Second, dtype: float64

In [62]:
df.describe() # Will skip string values

          First     Second
count  4.000000   4.000000
mean   2.500000   5.175000
std    1.290994   3.402328
min    1.000000   2.300000
25%    1.750000   3.125000
50%    2.500000   4.200000
75%    3.250000   6.250000
max    4.000000  10.000000

In [65]:
print(df.sum())

First                        10
Second                     20.7
Third     HelloPythonWorldsnake
dtype: object

In [71]:
df.sum()

First                        10
Second                     20.7
Third     HelloPythonWorldsnake
Fourth                       16
dtype: object

In [72]:
df2 = df.copy()

In [81]:
df2

   First  Second   Third  Fourth  Fifth
0      1    10.0   Hello     4.0     10
1      2     2.3  Python     2.0     10
2      3     3.4   World     9.0     20
3      4     5.0   snake     1.0     10

In [74]:
df2['Fifth'] = [10,10,20,10]
df2.mode()

   First  Second   Third  Fourth  Fifth
0      1     2.3   Hello     1.0   10.0
1      2     3.4  Python     2.0    NaN
2      3     5.0   World     4.0    NaN
3      4    10.0   snake     9.0    NaN

In [76]:
df2.cumsum()

   First  Second                  Third  Fourth  Fifth
0      1    10.0                  Hello     4.0     10
1      3    12.3            HelloPython     6.0     20
2      6    15.7       HelloPythonWorld    15.0     40
3     10    20.7  HelloPythonWorldsnake    16.0     50

In [79]:
df2['First'].mean() # To print individual values for a column.

2.5

In [82]:
df2

   First  Second   Third  Fourth  Fifth
0      1    10.0   Hello     4.0     10
1      2     2.3  Python     2.0     10
2      3     3.4   World     9.0     20
3      4     5.0   snake     1.0     10

In [87]:
df3 = df2.reindex(columns=["First","Third"],index= [1,2] )
print(df3)

   First   Third
1      2  Python
2      3   World

In [98]:
# TO RE-Order Data
dfr = df2.reindex(columns=['Third','Fourth','First',"Fifth",'Second'],index=[1,2])
dfr

    Third  Fourth  First  Fifth  Second
1  Python     2.0      2     10     2.3
2   World     9.0      3     20     3.4

In [101]:
df4 = df2.copy()
df4

   First  Second   Third  Fourth  Fifth
0      1    10.0   Hello     4.0     10
1      2     2.3  Python     2.0     10
2      3     3.4   World     9.0     20
3      4     5.0   snake     1.0     10

In [103]:
dfs = df4.reindex(columns=['First','Second','Third','forth'])
dfs

   First  Second   Third  forth
0      1    10.0   Hello    NaN
1      2     2.3  Python    NaN
2      3     3.4   World    NaN
3      4     5.0   snake    NaN

In [104]:
df

   First  Second   Third  Fourth
0      1    10.0   Hello     4.0
1      2     2.3  Python     2.0
2      3     3.4   World     9.0
3      4     5.0   snake     1.0

In [107]:
dfrename = df.rename(columns={'First':'A',"Third":'C'})
print(dfrename)

   A  Second       C  Fourth
0  1    10.0   Hello     4.0
1  2     2.3  Python     2.0
2  3     3.4   World     9.0
3  4     5.0   snake     1.0

In [108]:
dfx = df.reindex(index=[2,3,0,1])
dfx

   First  Second   Third  Fourth
2      3     3.4   World     9.0
3      4     5.0   snake     1.0
0      1    10.0   Hello     4.0
1      2     2.3  Python     2.0

In [111]:
dfx1 = dfx.sort_index()
dfx1
# This is sorted data

   First  Second   Third  Fourth
0      1    10.0   Hello     4.0
1      2     2.3  Python     2.0
2      3     3.4   World     9.0
3      4     5.0   snake     1.0

In [113]:
dfx

   First  Second   Third  Fourth
2      3     3.4   World     9.0
3      4     5.0   snake     1.0
0      1    10.0   Hello     4.0
1      2     2.3  Python     2.0

In [117]:
dfx2 = dfx.sort_values('Fourth',ascending=False)
dfx2

   First  Second   Third  Fourth
2      3     3.4   World     9.0
0      1    10.0   Hello     4.0
1      2     2.3  Python     2.0
3      4     5.0   snake     1.0

In [120]:
dfd = pd.DataFrame(np.random.randn(4,3),columns=['A','B','C'],index=['W','X','Y','Z'])
dfd

          A         B         C
W -0.708157  0.066542 -1.047673
X  0.563672 -0.883921  0.158261
Y  2.187690  0.290130 -1.154584
Z  0.326745  0.120264  1.513573

In [124]:
fd = dfd.loc[:,'C']
fd
# Will print every rows and 'C' column
# Syntax -> df.loc[rows,columns]

W   -1.047673
X    0.158261
Y   -1.154584
Z    1.513573
Name: C, dtype: float64

In [139]:
print(dfd.iloc[1,2])

0.1582607795902434

In [4]:
abc = pd.DataFrame({
    "Name":['Jatin','Rohan','Sarika','Paras'],
    "Marks":[12,23,45,56]
})
abc

     Name  Marks
0   Jatin     12
1   Rohan     23
2  Sarika     45
3   Paras     56

In [6]:
abc1 = pd.DataFrame(abc,index=[1,2,3,4],columns=["Marks","Name"])
abc1

   Marks    Name
1   23.0   Rohan
2   45.0  Sarika
3   56.0   Paras
4    NaN     NaN

In [7]:
abc

     Name  Marks
0   Jatin     12
1   Rohan     23
2  Sarika     45
3   Paras     56

In [8]:
abc.describe()

          Marks
count   4.00000
mean   34.00000
std    20.08316
min    12.00000
25%    20.25000
50%    34.00000
75%    47.75000
max    56.00000

In [12]:
abc['Marks'].pct_change()

0         NaN
1    0.916667
2    0.956522
3    0.244444
Name: Marks, dtype: float64

In [20]:
dictionary = {
    "Temp":[10,20,30,40],
    "Sales of ice_cream":[200,300,400,500],
    "Sales of hot_items":[200,100,50,25],
    "Sales of Shirt":[100,100,100,100]
}
a=pd.DataFrame(dictionary)
a["Temp"].corr(a['Sales of hot_items'])

-0.9591663046625439

In [22]:
dfq = pd.Series([1,23,4,5,6,3,4])
dfq

0     1
1    23
2     4
3     5
4     6
5     3
6     4
dtype: int64

# Aggreagate functions

In [24]:
a.agg(np.sum)

Temp                   100
Sales of ice_cream    1400
Sales of hot_items     375
Sales of Shirt         400
dtype: int64

In [25]:
a

   Temp  Sales of ice_cream  Sales of hot_items  Sales of Shirt
0    10                 200                 200             100
1    20                 300                 100             100
2    30                 400                  50             100
3    40                 500                  25             100

In [28]:
a[['Temp','Sales of ice_cream']].aggregate(np.mean)

Temp                   25.0
Sales of ice_cream    350.0
dtype: float64

In [29]:
a.aggregate({"Temp":np.mean,"Sales of ice_cream":np.sum})

Temp                    25.0
Sales of ice_cream    1400.0
dtype: float64

In [2]:
ab1 = pd.read_csv("titanic_dataset.csv")
ab1.sample(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.00,0,0,113783,26.5500,C103,S
810,811,0,3,"Alexander, Mr. William",male,26.00,0,0,3474,7.8875,NaN,S
783,784,0,3,"Johnston, Mr. Andrew G",male,NaN,1,2,W./C. 6607,23.4500,NaN,S
257,258,1,1,"Cherry, Miss. Gladys",female,30.00,0,0,110152,86.5000,B77,S
831,832,1,2,"Richards, Master. George Sibley",male,0.83,1,1,29106,18.7500,NaN,S
251,252,0,3,"Strom, Mrs. Wilhelm (Elna Matilda Persson)",female,29.00,1,1,347054,10.4625,G6,S
639,640,0,3,"Thorneycroft, Mr. Percival",male,NaN,1,0,376564,16.1000,NaN,S
309,310,1,1,"Francatelli, Miss. Laura Mabel",female,30.00,0,0,PC 17485,56.9292,E36,C
794,795,0,3,"Dantcheff, Mr. Ristiu",male,25.00,0,0,349203,7.8958,NaN,S
315,316,1,3,"Nilsson, Miss. Helmina Josefina",female,26.00,0,0,347470,7.8542,NaN,S

In [3]:
ab1.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [3]:
ab1['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [4]:
ab1['Sex'].mode()

0    male
dtype: object

In [5]:
print(ab1.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB
None

In [14]:
ab1.isnull()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,True,False
3,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,True,False
...,...,...,...,...,...,...,...,...,...,...,...,...
886,False,False,False,False,False,False,False,False,False,False,True,False
887,False,False,False,False,False,False,False,False,False,False,False,False
888,False,False,False,False,False,True,False,False,False,False,True,False
889,False,False,False,False,False,False,False,False,False,False,False,False
890,False,False,False,False,False,False,False,False,False,False,True,False

In [26]:
ab1[ab1['Cabin'].isnull()==True].head()
# Now in 'Cabin' column we can see only null values(NaN) are displayed.

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S

In [32]:
ab1['Age'].median()

28.0

In [33]:
ab1['Age'].fillna(ab1['Age'].median(),inplace=True)

In [38]:
ab1[ab1['Age'].isnull()==True]
# Now our Null Values are filled.

Empty DataFrame
Columns: [PassengerId, Survived, Pclass, Name, Sex, Age, SibSp, Parch, Ticket, Fare, Cabin, Embarked]
Index: []

In [42]:
ab1.info("Age")

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          891 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [7]:
ab1.to_csv("C:/Users/Jatin Bhardwaj/Documents/output_titanic2.csv",index=False)